

/*
*****************************************Copyright (c)*********************************************
**
**
**									 广州立锐升电子有限公司
**                             Guangzhou Lrsun Electronic Co.,Ltd.
**
**                                    http://www.lrsun.net
**
**
**
**	文件名	：DataStg.c
**
**	程序员	：陈家承
**
**	日　期  ：2009年1月19日
**
**	文件描述：各数据类型转拆成多个字节存储，从多个保存的字节读出，转换成相应的类型的数。
**
**
***************************************************************************************************
*/
/*
***************************************************************************************************
**                                         浮点数的存储
**
**	将运算的结果（浮点数）存入eeprom中。我们知道，浮点数在c语言中是以ieee格式存储的，一个浮点数
**	占用四个字节，例如浮点数34.526存为（160，26，10，66）这四个数。要将一个浮点数存入eeprom，实
**	际上就是要存这四个数。那么如何在程序中得到一个浮点数的组成数呢？
**
**	浮点数在存储时，是存储连续的字节中的，只要设法找到存储位置，就可以得到这些数了。可以定义一
**	个 void 的指针，将此指针指向需要存储的浮点数，然后将此指针强制转化为 char 型，这样，利用指
**	针就可以得到组成该浮点数的各个字节的值了。具体程序如下：
**
***************************************************************************************************
*/

#include 	"DataStg.h"



/*
***************************************************************************************************
**
**                                       DSTStr2Byte()
**
**
**	功能描述：结构体变量转成Bytes处理
**
**	参  数  ：*pDat		Bytes指针
**            *pStr 	结构体指针
**			   len 	    结构体长度(byte)
**
**	返回值  ：无
**
***************************************************************************************************
*/
void DSTStr2Byte(uint8 *pDat, void *pStr, int32 len)
{
	int32	i;

	for (i = 0; i < len; i++)
	{
		*(pDat + i) = *((char *)pStr + i); 	// 强制 void 型指针转成 char 型,因为	
	}                            		// void 型指针不能运算	
}

/*
***************************************************************************************************
**
**                                       DSTByte2Str()
**
**
**	功能描述：结构体变量转成Bytes处理的反运算
**
**	参  数  ：*pDat		Bytes指针
**            *pStr 	结构体指针
**			   len 	    结构体长度(byte)
**
**	返回值  ：无
**
***************************************************************************************************
*/
void DSTByte2Str(uint8 *pDat, void *pStr, int32 len)
{
	int32 i;

	for (i = 0; i<len; i++)
	{
		*((char *)pStr + i) = *(pDat + i); 	// 强制 void 型指针转成 char 型,因为
	}                            		// void 型指针不能运算	
}

/*
***************************************************************************************************
**
**                                       DstFlt2Chr()
**
**
**	功能描述：浮点型变量拆分成四个字节
**
**	参  数  ：fval	要转换的 float 值
**            px 	转换后的四个字节数据的头地址
**
**	返回值  ：无
**
***************************************************************************************************
*/
void DstFlt2Chr(uint8 *px, fp32 fVal)
{
	uint8	i;
	//	uint8	x[4];   				// 定义字符数组，准备存储浮点数的四个字节
	void	*pf;

	//	px = x;                			// px 指针指向数组 x
	pf = &fVal;            			// void 型指针指向浮点数首地址
	//	a  = 34.526;

	for (i = 0; i<4; i++)
	{
		*(px + i) = *((char *)pf + i); 	// 强制 void 型指针转成 char 型,因为	
	}                            	// void 型指针不能运算	

}
/*
***************************************************************************************************
**
**	如果已将数存入eeprom，要将其取出合并，方法也是一样，可参考下面的程序。
**
***************************************************************************************************
*/
/*
***************************************************************************************************
**
**                                        DstChr2Flt()
**
**
**	功能描述：四个字节合并成浮点型变量
**
**	参  数  ：px 	字节的入口地址
**
**	返回值  ：f_val	返回的 float 类型数
**
***************************************************************************************************
*/
fp32 DstChr2Flt(uint8 *px)
{
	fp32	fVal;
	uint8	i;
	//	uint8	x[4]={56,180,150,73};
	void	*pf;

	//	px = x;
	pf = &fVal;

	for (i = 0; i<4; i++)
	{
		*((int8 *)pf + i) = *(px + i);
	}

	return fVal;
}
/*
***************************************************************************************************
**
**                                       DstInt2Chr()
**
**
**	功能描述：长整型变量拆分成四个字节
**
**	参  数  ：i_val	要转换的 int 数
**            px 	转换后的四个字节数据的头地址
**
**	返回值  ：无
**
***************************************************************************************************
*/
void DstInt2Chr(uint8 *px, int32 iVal)
{
	uint8	i;
	void	*pf;

	pf = &iVal;

	for (i = 0; i<4; i++)
	{
		*(px + i) = *((int8 *)pf + i);
	}
}
/*
***************************************************************************************************
**
**                                      DstChr2Int()
**
**
**	功能描述：四个字节合并成长整型变量
**
**	参  数  ：px 	字节的入口地址
**
**	返回值  ：i_val	返回的 int 类型数
**
***************************************************************************************************
*/
int32 DstChr2Int(uint8 *px)
{
	int32 	iVal;
	uint8	i;
	void 	*pf;

	pf = &iVal;

	for (i = 0; i<4; i++)
	{
		*((char *)pf + i) = *(px + i);
	}

	return iVal;
}
/*
***************************************************************************************************
**
**                                       DstSht2Chr()
**
**
**	功能描述：短整型变量拆分成两个字节
**
**	参  数  ：s_val	要转换的 short 数
**            px 	转换后的两个字节数据的头地址
**
**	返回值  ：无
**
***************************************************************************************************
*/
void DstSht2Chr(uint8 *px, int16 sVal)
{
	uint8	i;
	void 	*pf;

	pf = &sVal;

	for (i = 0; i<2; i++)
	{
		*(px + i) = *((char *)pf + i);
	}
}
/*
***************************************************************************************************
**
**                                      DstChr2Sht()
**
**
**	功能描述：两个字节合并成短整型变量
**
**	参  数  ：px 	字节的入口地址
**
**	返回值  ：s_val	返回的 short 类型数
**
***************************************************************************************************
*/
int16 DstChr2Sht(uint8 *px)
{
	int16	sVal;
	uint8	i;
	void 	*pf;

	pf = &sVal;

	for (i = 0; i<2; i++)
	{
		*((char *)pf + i) = *(px + i);
	}

	return sVal;
}




























